{
  "HeroContent": {
    "subtitle": "Front-End Developer",
    "shortPharse": "I'm passionate about crafting accessible digital experiences with thoughtful, detail-oriented design."
  },
  "AboutMe": [
    "I'm a Senior Front-End Developer, passionate about creating accessible web experiences while paying attention to every detail.",
    "I'm currently part of the Digital Transformation team at Grupo Ficohsa, where I develop modern front-end applications that allow clients to open savings accounts faster, more easily, and entirely online. My focus is on improving usability, accessibility, and building new digital products.",
    "Previously, I worked at Gaia Consultores, leading automation and full-stack development projects. I designed and implemented RPA and web solutions that optimized internal processes and reduced operational workload, using technologies such as React, Node.js, and Express.",
    "At Victoria Importadora, I implemented new features in the existing theme and built a React-based web application for a loyalty points system connected to the Shopify API. My experience has taught me to approach every project with a focus on performance, scalability, and user experience."
  ],
  "NavBar": {
    "about": "About",
    "experiences": "Experience",
    "projects": "Projects"
  },
  "ExperienceSection": {
    "experiences": [
      {
        "period": "2014 - Present",
        "title": "Senior Front-End Developer",
        "company": "Grupo Ficohsa",
        "content": "I'm part of the digital transformation of the savings accounts division, developing modern front-end applications that make it easy for clients to open their accounts quickly, intuitively, and entirely online. I collaborate closely with back-end teams and other departments to reliably integrate financial data, continuously improving both the user experience and platform performance to make every digital interaction faster and more seamless.",
        "badges": [
          "Next.js",
          "Typescript",
          "Storybook",
          "Figma",
          "Jira",
          "Azure"
        ],
        "link": "https://www.grupoficohsa.com/"
      },
      {
        "period": "2023 - 2024",
        "title": "Senior RPA Developer",
        "company": "Gaia Consultores",
        "content": "I led automation and process improvement initiatives, defining bot architectures, selecting tools and technologies, and overseeing the entire process lifecycle. My focus was on reducing operational workloads and increasing efficiency across departments while ensuring that every solution was scalable, reliable, and easy to maintain.",
        "badges": ["Javascript", "Vbscript", "Agility", "Electroneeck"],
        "link": "https://gaiaconsultoresrpa.com/somos-gaia-consultores/"
      },
      {
        "period": "2021 - 2023",
        "title": "Front/Back-End Developer",
        "company": "Gaia Consultores",
        "content": "I was responsible for gathering requirements, analyzing, and designing integrated solutions to automate processes, developing web applications and APIs that supported both RPA bots and end users.",
        "badges": ["Javascript", "Express", "Node.js", "React"],
        "link": "https://gaiaconsultoresrpa.com/somos-gaia-consultores/"
      },
      {
        "period": "2019 - 2021",
        "title": "RPA Developer",
        "company": "Gaia Consultores",
        "content": "I worked on automating and improving business processes through RPA solutions, based on workflows defined by project leads. My goal was to reduce manual workloads and boost efficiency while collaborating closely with teams and stakeholders to ensure reliable and functional automation.",
        "badges": ["Agility", "Javascript", "HTML & CSS", "Node.js"],
        "link": "https://gaiaconsultoresrpa.com/somos-gaia-consultores/"
      },
      {
        "period": "2015 - 2019",
        "title": "Front/Back-End Developer",
        "company": "Importadora Victoria",
        "content": "I developed and maintained the company's core system using Shopify, improving both internal operations and the overall digital experience to make processes more efficient and user-friendly.",
        "badges": ["Liquid", "React", "Shopify", "Node.js", "Express"],
        "link": "https://victoriaecuador.com/"
      }
    ]
  },
  "ProjectsSection": {
    "projects": [
      {
        "title": "Microfrontend Pokémon",
        "content": "Aplicación web creada con la API de Pokémon para demostrar el uso de microfrontends. Incluye temas como consumo de APIs REST, arquitectura modular, React, comunicación entre módulos y despliegue independiente.",
        "badges": [
          "Javascript",
          "Typescript",
          "React",
          "Next.js",
          "Module Federation"
        ],
        "link": "https://host-woad.vercel.app/",
        "image": "/microfrontend_pokemon.png"
      }
    ]
  }
}
